<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
        "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
	<head>
		<title>Curriculum Vitae</title>
		<meta http-equiv="content-type" content="text/html;charset=utf-8" />
		<meta name="viewport" content="width=device-width, initial-scale=1.0" />
		<link href="Style.css" type="text/css" rel="stylesheet" media="screen" />
		<link href="Style_Print.css" type="text/css" rel="stylesheet" media="print" />
	</head>
	
	<body>
		<ul class="Menu">
			<li><a href="index.html">Page d'accueil</a></li>
			<li class="Menu_Tab_Selected">Curriculum Vitae</li>
			<li><a href="Hardware_Projects.html">Electronique</a></li>
			<li><a href="Software_Projects.html">Informatique</a></li>
			<li><a href="Links.html">Liens</a></li>
		</ul>
		
		<div class="Page_Body">
			<p>
				Adrien RICCIARDI<br />
				Permis B + V&eacute;hicule<br />
				25 ans<br />
			</p>
			
			<h1>Ing&eacute;nieur informaticien syst&egrave;mes embarqu&eacute;s</h1>
			
			<h2>Parcours de formation</h2>
			<ul>
				<li><strong>2011/2014 : </strong>Polytech Marseille (ex Ecole Sup&eacute;rieure d'Ing&eacute;nieurs de Luminy), Marseille,
				Fili&egrave;re Informatique, R&eacute;seaux et Multim&eacute;dia.</li>
				<li><strong>2009/2011 : </strong>IUT Universit&eacute; Paul C&eacute;zanne III, Marseille,
				D&eacute;partement G&eacute;nie Electrique et Informatique Industrielle (GEII).</li>
				<li><strong>2008/2009 : </strong>Lyc&eacute;e Fr&eacute;d&eacute;ric Joliot-Curie, Aubagne,
				Baccalaur&eacute;at scientifique Sciences de la Vie et de la Terre option Sciences
				de la Vie et de la Terre, mention assez bien.</li>
			</ul>
			
			<h2>Aptitudes</h2>
			<ul>
				<li><strong>Informatique : </strong>Programmation, d&eacute;veloppement d'applications et de syst&egrave;mes, d&eacute;veloppement de drivers Linux et programmation kernel, programmation de microcontr&ocirc;leurs sans syst&egrave;me d'exploitation.</li>
				<li><strong>Electronique : </strong>Electronique logique, microcontr&ocirc;leurs, robotique mobile.</li>
			</ul>
			
			<h2>Comp&eacute;tences informatiques</h2>
			<ul>
				<li><strong>D&eacute;veloppement : </strong>C, assembleur x86, assembleur PIC, C++, Java.</li>
				<li><strong>Logiciels : </strong>gcc et suite GNU, NASM, MPLAB, Eclipse, MS Visual Studio.</li>
				<li><strong>Plateformes : </strong>Linux, BSD, Windows, <a href="https://en.wikipedia.org/wiki/Bare_machine">bare metal</a>.</li>
				<li><strong>Technologies CPU : </strong>Bonne connaissance des coeurs PIC16, PIC18, 8051, x86. Connaissance des coeurs MIPS 4K, Z80 et ARM11.</li>
				<li><strong>Bus : </strong>Bus classiques de microcontr&ocirc;leurs (I2C, UART, SPI...), PCI, USB.</li>
			</ul>
			
			<h2>Comp&eacute;tences linguistiques</h2>
			<ul>
				<li><strong>Anglais : </strong>lu, &eacute;crit, parl&eacute;. Bonne ma&icirc;trise de l'anglais technique (880 au TOEIC en juin 2012).</li>
				<li><strong>Italien : </strong>bilingue.</li>
			</ul>
			
			<h2>R&eacute;alisations techniques</h2>
			<ul>
				<li><strong>2015/2016 : </strong>Conception et impl&eacute;mentation en langage C d'un simulateur de c&oelig;ur Microchip PIC16 (<a href="https://github.com/RICCIARDI-Adrien/Text_Games_System_Simulator">voir les sources</a>).</li>
				<li><strong>2014/2015 : </strong>Conception et r&eacute;alisation d'un robot mobile dot&eacute; d'un unique capteur de distance servant &agrave; tester des algorithmes d'intelligence artificielle (<a href="Projects/Explorer/Explorer.html">voir le projet</a>).</li>
				<li><strong>2013/2014 : </strong>Conception et r&eacute;alisation d'un robot mobile &agrave; base d'un Raspberry Pi (<a href="Projects/Odyssey/Odyssey.html">voir le projet</a>).</li>
				<li><strong>2012/2013 : </strong>Conception et d&eacute;veloppement de pilotes USB HID Linux g&eacute;rant des p&eacute;riph&eacute;riques d'entr&eacute;e utilisateur (3 mois).</li>
				<li><strong>2011/2012 : </strong>Programmation d'une station météorologique (développement de pilotes, programmation concurrente) basée sur uClinux et un coeur ARM7 en projet d'architecture ESIL (2 mois).</li>
				<li><strong>2010/2011 : </strong>Conception, r&eacute;alisation et programmation d'une carte d'extension sur bus ISA pour PC IBM en Etudes et R&eacute;alisations GEII (18 heures).</li>
				<li><strong>2007/2016 : </strong>Syst&egrave;me d'exploitation 32 bits pour PC x86 (kernel, drivers, stack r&eacute;seau, biblioth&egrave;que userspace, shell, programmes userspace) &agrave; titre personnel (9 ans).</li>
			</ul>
			
			<h2>Exp&eacute;riences professionnelles</h2>
			<ul>
				<li><strong>2016 : </strong>D&eacute;veloppement de la box <a href="http://assistance.sfr.fr/internet-et-box/box-plus-de-sfr/box-nb6vac-caracteristiques.html">NB6VAC</a> (connue sous le nom de &quot;la box Plus de SFR&quot;) : debug hardware; conception et d&eacute;veloppement du firmware du microcontr&ocirc;leur embarqu&eacute;; d&eacute;veloppement de drivers Linux; portage, int&eacute;gration et optimisation de la partie VoIP.</li>
				<li><strong>2014 : </strong>Ing&eacute;nieur Recherche &amp; D&eacute;veloppement chez SFR.</li>
				<li><strong>2013/2014 : </strong>Stage de fin d'&eacute;tudes de six mois en entreprise (SFR, anciennement Efixo), portage du bootloader U-Boot sur une box.</li>
				<li><strong>2012/2013 : </strong>Stage de trois mois en entreprise (Efixo, R&amp;D de SFR), &eacute;tude et modification d'un acc&eacute;l&eacute;rateur de paquets r&eacute;seau.</li>
				<li><strong>2011/2012 : </strong>CDD d'un mois en entreprise (Nexvision SAS, entreprise française spécialiste du monde de la vision électronique), développement en C++ de l'architecture d'un serveur de streaming.</li>
				<li><strong>2011/2012 : </strong>Stage d'un mois en entreprise, participation à la conception d'un serveur de streaming pour plateformes embarquées et écriture de documents techniques (Nexvision SAS).</li>
				<li><strong>2010/2011 : </strong>CDD d'un mois en entreprise, participation au d&eacute;veloppement d'un automate programmable pour le march&eacute; industriel (NexIO de Nexvision SAS).</li>
				<li><strong>2010/2011 : </strong>Stage d'un mois en entreprise, participation à la conception et à la programmation d'un TAG ZigBee pour le monde de l'industrie (NexTag de Nexvision SAS).</li>
			</ul>
			
			<h2>Centres d'int&eacute;r&ecirc;t</h2>
			<ul>
				<li><strong>Sport : </strong>Pratique du Judo et du Jiu-Jitsu pendant 10 ans (ceinture marron), natation, randonn&eacute;es.</li>
				<li><strong>Passions : </strong>La programmation, le bricolage, la litt&eacute;rature.</li>
			</ul>
			
			<h2>Mes atouts</h2>
			<ul>
				<li>S&eacute;rieux, polyvalent, sachant s'adapter.</li>
			</ul>
			
			<p class="W3C_Validator">
				<a href="http://validator.w3.org/check?uri=referer"><img src="http://www.w3.org/Icons/valid-xhtml10" alt="Valid XHTML 1.0 Strict" height="31" width="88" /></a>
			</p>
		</div>
	</body>
</html>
