<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
        "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
	<head>
		<title>Jeu du morpion revisit&eacute;</title>
		<meta http-equiv="content-type" content="text/html;charset=utf-8" />
		<meta name="viewport" content="width=device-width, initial-scale=1.0" />
		<link href="../../Style.css" type="text/css" rel="stylesheet" title="Style" />
	</head>
	<body>
		<ul class="Menu">
			<li><a href="../../index.html">Page d'accueil</a></li>
			<li><a href="../../CV.html">Curriculum Vitae</a></li>
			<li><a href="../../Hardware_Projects.html">Electronique</a></li>
			<li id="Menu_Tab_Selected_Clickable"><a href="../../Software_Projects.html">Informatique</a></li>
			<li><a href="../../Links.html">Liens</a></li>
		</ul>

		<div class="Page_Body">
			<h1>Jeu du morpion revisit&eacute;</h1>
			<img class="Centered_Image" src="Tic_Tac_Toe_Grid.png" alt="Grille de morpion" />

			<h3>Introduction</h3>
			<p>
				Ce programme est un Proof of Concept dont le but est de tester si une intelligence artificielle diff&eacute;rente de l'approche classique est viable pour le jeu du morpion.
				L'intelligence artificielle traditionnelle de ce genre de jeu se base sur une simulation de plusieurs coups dans le futur pour d&eacute;terminer quel est le meilleur coup &agrave; jouer.
				Mon intelligence artificielle se base uniquement sur l'&eacute;tat actuel de la grille pour choisir le meilleur coup.
			</p>
			<p>
				Pour pimenter un peu le jeu du morpion, il faut d&eacute;sormais aligner 5 pions identiques sur une grille allant de 10x10 cases &agrave; 20x20 cases.
				De plus, il n'est possible de placer un pion qu'&agrave; proximit&eacute; d'une case contenant d&eacute;j&agrave; un pion.
			</p>
			<p>
				J'ai impl&eacute;ment&eacute; cette version "revisit&eacute;e" du jeu de morpion dans un programme C pr&eacute;vu pour fonctionner dans un terminal VT100 (tous les terminaux de syst&egrave;mes &agrave; base UNIX sont compatibles, ainsi que celui de Cygwin).
			</p>
			
			<h3>Fonctionnement de l'IA</h3>
			<p>
				L'IA se contente de comparer une suite de <strong>patterns</strong> (des motifs repr&eacute;sentant un alignement de pions) &agrave; l'ensemble de la grille. Une valeur est associ&eacute;e &agrave; chaque pattern en fonction de "l'importance" de ce dernier.
				Un pattern de valeur &eacute;lev&eacute;e repr&eacute;sente une configuration de pions proche de la victoire. A l'inverse, une configuration de pions ne pouvant mener &agrave; la victoire qu'apr&egrave;s de nombreux autres coups a une valeur basse.
				La somme de la valeur de chaque pattern trouv&eacute; sur la grille correspond &agrave; l'<strong>&eacute;valuation</strong> de la grille. Une &eacute;valuation &eacute;lev&eacute;e indique que des patterns pouvant rapidement mener &agrave; la victoire sont pr&eacute;sents sur la grille (par exemple, 4 pions align&eacute;s).
			</p>
			<p>
				L'IA va &eacute;valuer chaque coup possible pour l'&eacute;tat actuel de la grille et retenir deux valeurs. La plus grande valeur obtenue avec les pions jou&eacute;s par l'IA, c'est-&agrave;-dire le coup qui m&egrave;nera le plus rapidement &agrave; une victoire de l'IA, est sauvegard&eacute;e en tant que coup <strong>offensif</strong>.
				La deuxi&egrave;me valeur est la valeur minimale trouv&eacute;e en &eacute;valuant chaque coup du point de vue de l'adversaire. Minimiser cette valeur revient &agrave; emp&ecirc;cher tout coup menant &agrave; la victoire. Cette deuxi&egrave;me valeur est sauvegard&eacute;e en tant que coup <strong>d&eacute;fensif</strong>.
			</p>
			<p>
				Une heuristique favorisant la d&eacute;fense (car le joueur est bien plus fut&eacute; que l'IA, il faut donc l'emp&ecirc;cher le plus possible de mettre au point une strat&eacute;gie) choisit ensuite le coup &agrave; jouer.
				Un coup offensif ne sera jou&eacute; que s'il permet &agrave; l'IA de gagner rapidement ou s'il n'y a aucun int&eacute;r&ecirc;t &agrave; bloquer le joueur car il est beaucoup trop loin d'une victoire potentielle.
			</p>
			<p>
				Cette IA ne peut certes pas rivaliser avec une IA qui simule les coups futurs mais donne tout de m&ecirc;me du fil &agrave; retordre au joueur, et ce avec un temps d'ex&eacute;cution beaucoup plus bref qu'une IA r&eacute;cursive.
			</p>
			<p>
				Bonne chance !
			</p>
			
			<h3>Obtenir le programme</h3>
			<p>
				Le programme est pens&eacute; pour un terminal VT100 tels que ceux disponibles sous les syst&egrave;mes UNIX. Cependant, le jeu fonctionne parfaitement sous Windows en utilisant l'environnement Cygwin.<br />
				Le jeu a &eacute;t&eacute; test&eacute; sous Debian, Arch Linux, FreeBSD, Windows XP, 7 &amp; 10 (sous Cygwin) et m&ecirc;me sur un Raspberry Pi 1 mod&egrave;le B tournant sous Raspbian. <br />
				Les sources sont disponibles sur <a href="https://github.com/RICCIARDI-Adrien/Tic_Tac_Toe">GitHub</a>.
			</p>

			<a href="../../Software_Projects.html">Retour au menu des projets</a>
			
			<p>
				Page cr&eacute;&eacute;e le 21/02/2016.<br />
			</p>
		</div>
	</body>
</html>